{
  "id": "865a484c-4e92-4962-870c-a0b53e0c8f80",
  "title": "This is a test long title U",
  "content": "# Blog Post Draft Manager Project Plan\n\n## Introduction\nThe purpose of this project is to develop a desktop application for managing blog post drafts. This application will enable users to create, edit, and organize their blog post drafts efficiently using markdown formatting and image integration. Built as a standalone executable using NextJS and ElectronJS, the app aims to provide a seamless and modern user experience for bloggers managing multiple drafts.\n\n![Image](/images/1747125137309-HIRO.jpg)\n\n## Requirements\n\n### Functional Requirements\nThe following features and functionalities define what the application must do:\n- The application shall be a standalone executable built using NextJS and ElectronJS, requiring no installation setup.\n- It shall use a single `.json` file as the backend database to store all blog post drafts.\n- Images shall be stored in a separate folder at the backend, with each image saved using a universally unique identifier (UUID) as its filename.\n- The user interface shall feature a side navigation menu with three items: Dashboard, Posts, and Settings.\n- The Posts page shall display a list of all draft posts and include a button to create a new post.\n- Upon clicking the new post button, the application shall navigate to a new post designing page where users can provide post content in markdown format.\n- The new post designing page shall allow users to upload a `.md` file, display a live preview of the post on the side, and enable direct editing of the `.md` file within the app.\n- Users shall be able to add images to the post by uploading them, with images saved in the designated folder using UUIDs and referenced in the markdown content.\n- After saving a post, the application shall redirect the user back to the Posts page.\n- On the Posts page, the application shall support CRUD operations (Create, Read, Update, Delete) on each post.\n- The application shall utilize Material-UI (MUI) components to achieve a modern and consistent user interface design.\n- The default font throughout the application shall be Roboto.\n\n### Non-Functional Requirements\nThe following qualities ensure the application's performance, usability, and reliability:\n- The application shall provide a responsive and intuitive user experience, with quick loading times and smooth interactions.\n- It shall handle errors gracefully, maintaining data integrity and providing clear feedback to the user (e.g., in case of file access issues).\n- The application shall be cross-platform, compatible with Windows, macOS, and Linux operating systems.\n- It shall maintain a modern, consistent, and user-friendly interface design throughout all pages and interactions.\n\n## Technical Approach\nThe application will be developed using the following technologies and architectural considerations:\n- **Frontend:** NextJS, a React framework, will be used to build the user interface, integrated with MUI components and styled with the Roboto font.\n- **Backend:** ElectronJS will serve as the desktop application framework, with its main process handling file system operations.\n- **Data Storage:** A single `.json` file will store an array of post objects (each with id, title, content, and timestamps), located in the app’s user data directory. Images will be stored in a separate folder within the same directory, named with UUIDs.\n- **Communication:** Inter-Process Communication (IPC) will facilitate data exchange between the NextJS renderer process and the Electron main process for file operations.\n- **Markdown Handling:** A markdown parsing library (e.g., `marked.js`) will render markdown content to HTML for the preview functionality.\n- **Image Management:** Uploaded images will be saved with UUID filenames in the images folder and referenced in the markdown using relative paths (e.g., `images/uuid.jpg`), with proper path resolution for display.\n\n## Development Plan\nThe development will proceed through the following phases:\n1. **Project Setup:** Initialize the project structure with NextJS and ElectronJS integration.\n2. **Backend Implementation:** Develop the Electron main process to handle `.json` file operations and image storage.\n3. **UI Development:** Create the user interface using NextJS and MUI, including the side navigation and core pages (Dashboard, Posts, Settings).\n4. **Posts Functionality:** Implement the posts list and CRUD operations on the Posts page.\n5. **Post Editor:** Build the post designing page with markdown editing, preview, and image upload capabilities.\n6. **Integration:** Connect frontend and backend via IPC for seamless data management.\n7. **Testing:** Validate functionality, performance, and cross-platform compatibility.\n8. **Packaging:** Build and package the application into standalone executables for Windows, macOS, and Linux using tools like `electron-builder`.\n\n## Risks and Mitigations\n- **Risk:** Inconsistent file path handling across operating systems.\n  - **Mitigation:** Utilize Node.js `path` module and Electron’s `app.getPath` for platform-agnostic path management.\n- **Risk:** Performance degradation with a large number of posts or images.\n  - **Mitigation:** Optimize data loading and consider lazy loading or pagination if performance issues arise.\n- **Risk:** Security vulnerabilities in file access.\n  - **Mitigation:** Restrict file operations to the app’s data directory and validate all file paths.",
  "images": [
    "/images/1747125137309-HIRO.jpg"
  ],
  "tags": [],
  "createdAt": "2025-05-10T17:29:32.009Z",
  "updatedAt": "2025-05-11T17:24:19.144Z",
  "status": "draft",
  "modified": "2025-05-13T08:32:18.855Z"
}